[ {
  "id": 1,
  "title": "adana",
  "ingredients": [
    "1 kg ground lamb",
    "Kosher salt",
    "4 teaspoons ground cumin, divided",
    "4 tablespoons ground sumac, divided",
    "4 tablespoon ground Urfa pepper flakes, divided",
    "4 tablespoons ice-cold water"
  ],
  "image": "https://upload.wikimedia.org/wikipedia/commons/5/55/Adana_kebab.jpg",
  "prepTime": 60,
  "steps": [
    "1. For the Kebabs: Combine lamb with 7.5 grams (about 2 teaspoons) kosher salt, 1 teaspoon cumin, 2 teaspoons sumac, and 1 tablespoon pepper flakes. Knead by hand or in a stand mixer fitted with a paddle attachment until mixture turns tacky and starts sticking to the side of the bowl. Add water and continue kneading until incorporated. Place in refrigerator and chill well.",
    "2. Meanwhile, combine remaining teaspoon cumin, 2 teaspoons sumac, remaining tablespoon pepper flakes, and 2 teaspoons salt in a small bowl. Set spice mixture aside. Combine remaining 2 teaspoons sumac and red onions in a medium bowl. Season with salt to taste and set aside.",
    "3. Using wet hands, divide lamb mixture into 12 even balls. Using wet hands, form each ball into a long, flat kebab around a skewer.",
    "4. Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate. Place kebabs directly over hot side of grill, cover, and cook, turning occasionally and sprinkling with spice mixture until well charred on both sides and kebabs are cooked through, about 12 minutes total.",
    "5. During last few minutes of cooking, place bread directly on top of kebabs in batches until heated through.",
    "6. Serve kebabs with warm bread, sumac onions, parsley, tomatoes, and pickled peppers."
  ],
  "author": "Mohammad",
  "countryOfOrigin": "Turkey",
  "category": "Meat",    
  "course": "Main"
},
  {
    "id": 2,
  "title": "Masala Chai",
      "category": "Drink",    
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Masala_Chai.JPG/2560px-Masala_Chai.JPG",
  "ingredients": [
    "1 cup milk",
    "1/3 cup Water",
    "pinch of salt",
    "1 teaspoons sugar",
    "1/2 cinnamon stick",
    "1 teabag",
    "2 cardamom"
  ],
  "prepTime": 15,
  "steps": [
    "First put some water in a saucepan and bring to boil",
    "Next put the salt, sugar, cinnamon, cardamom's and and teabag and simmer for 30 seconds",
    "Put in the milk and gently boil for 10mins",
    "Bring a bubbling boil for 2 more mins and then strain over a mug",
    "Traditionally served with fruit cakes and rusks"

    
  ],
  "author": "Mohbeen",
  "countryOfOrigin": "Kashmir",
  "course": "Refreshment"
},
{
  "id": 3,
  "title": "Baseema",
  "category": "Cake",    
  "image": "https://3.bp.blogspot.com/-g0nhXA-654E/VqWEJKrB7RI/AAAAAAAABPU/8kedwlf7yUM/s400/IMG_0654.JPG",
  "ingredients": [
    "5 eggs",
    "1 cup icing sugar",
    "3/4 cup butter or oil",
    "500g yogurt",
    "2 teaspoons baking powder",
    "2 cups flour",
    "1 teaspoon vanilla essence",
    "1 cup coconut",
    "1 cup coconut",
    "1 cups sugar",
    "1 tablespoon lemon juice",
    "1 cup water"
  ],
  "prepTime": 30,
  "steps": [
    "Beat eggs and sugar. Add oil and yogurt and mix.",
    "In a separate bowl sift flour and add baking powder and coconut, then add to the mixture while stirring.",
    "Spread mixture onto greased 9x13 dish. Bake for 30 minutes 200° Celsius/400°F.",
    "In another saucepan, mix sugar and lemon with water, boil until syrup thickens.",
    "When cake is cooked, pour syrup over evenly so it soaks through."
   
  ],
  "author": "Ahmed",
  "countryOfOrigin": "Sudan",
  "course": "Dessert"
}
]